---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldOffsetY
source: html/20bfe57c-7f4f-f4b7-c65f-9702c4b68897.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldOffsetY Property

The property labeled "Offset Y" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".